name: "xtts_python"
platform: "python"
max_batch_size: 8

input [
  {
    name: "TEXT"
    data_type: TYPE_STRING
    dims: [ 1 ]
  },
  {
    name: "SPEAKER_WAV_B64"
    data_type: TYPE_STRING
    dims: [ 1 ]
  }
]

output [
  {
    name: "AUDIO_B64"
    data_type: TYPE_STRING
    dims: [ 1 ]
  }
]

instance_group [
  {
    kind: KIND_CPU
    count: 1
  }
]

